# Prac 4A

In [ ]:
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.functions import approx_count_distinct, collect_list
from pyspark.sql.functions import collect_set, sum, avg, max, countDistinct, count
from pyspark.sql.functions import first, last, kurtosis, min, mean, skewness
from pyspark.sql.functions import stddev, stddev_samp, stddev_pop, sumDistinct
from pyspark.sql.functions import variance, var_samp, var_pop

In [ ]:
spark = SparkSession.builder.appName("exams").getOrCreate()

In [ ]:
simpleData = [("James", "Sales", 3000),
              ("Michael", "sales", 4600),
              ("Robert", "Sales", 4100),
              ("Maria", "Finance", 3000),
              ("James", "Sales", 3000),
              ("Scott", "Finance", 3300),
              ("Jen", "Finance", 3900),
              ("Kumar", "marketing", 2000) ,
              ("Saif","sales", 4100)
              ]

In [ ]:
schema = ["employee_name", "department", "salary"]

In [ ]:
df = spark.createDataFrame(data = simpleData, schema = schema)
df.printSchema()
df.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- salary: long (nullable = true)

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|James        |Sales     |3000  |
|Michael      |sales     |4600  |
|Robert       |Sales     |4100  |
|Maria        |Finance   |3000  |
|James        |Sales     |3000  |
|Scott        |Finance   |3300  |
|Jen          |Finance   |3900  |
|Kumar        |marketing |2000  |
|Saif         |sales     |4100  |
+-------------+----------+------+

In [ ]:
print("approx_count_distinct: ", str(df.select(approx_count_distinct("salary")).collect()[0][0]))

approx_count_distinct:  6

In [ ]:
print("avg", str(df.select(avg("salary")).collect()[0][0]))

avg 3444.4444444444443

In [ ]:
df.select(collect_list("salary")).show(truncate=False)

+------------------------------------------------------+
|collect_list(salary)                                  |
+------------------------------------------------------+
|[3000, 4600, 4100, 3000, 3000, 3300, 3900, 2000, 4100]|
+------------------------------------------------------+

In [ ]:
df.select(collect_set("salary")).show(truncate=False)

+------------------------------------+
|collect_set(salary)                 |
+------------------------------------+
|[4600, 3000, 3900, 4100, 3300, 2000]|
+------------------------------------+

In [ ]:
df2 = df.select(countDistinct("department", "salary"))
df2.show(truncate=False)
print("Distinct COunt of Department&salary:", str(df2.collect()[0][0]))

+----------------------------------+
|count(DISTINCT department, salary)|
+----------------------------------+
|8                                 |
+----------------------------------+

Distinct COunt of Department&salary: 8

In [ ]:
print("count: ", str(df.select(count("salary")).collect()[0]))
df.select(first("salary")).show(truncate=False)
df.select(last("salary")).show(truncate=False)

count:  Row(count(salary)=9)
+-------------+
|first(salary)|
+-------------+
|3000         |
+-------------+

+------------+
|last(salary)|
+------------+
|4100        |
+------------+

In [ ]:
df.select(kurtosis("salary")).show(truncate=False)
df.select(max("salary")).show(truncate=False)
df.select(min("salary")).show(truncate=False)
df.select(mean("salary")).show(truncate=False)
df.select(skewness("salary")).show(truncate=False)
df.select(stddev("salary"),stddev_pop("salary"), stddev_samp("salary")).show(truncate=False)
df.select(sum("salary")).show(truncate=False)
df.select(sumDistinct("salary")).show(truncate=False)
df.select(variance("salary"), var_samp("salary"), var_pop("salary")).show(truncate=False)
# df.select(max("salary")).show(truncate=False)

+-------------------+
|kurtosis(salary)   |
+-------------------+
|-0.6953888522988017|
+-------------------+

+-----------+
|max(salary)|
+-----------+
|4600       |
+-----------+

+-----------+
|min(salary)|
+-----------+
|2000       |
+-----------+

+------------------+
|avg(salary)       |
+------------------+
|3444.4444444444443|
+------------------+

+--------------------+
|skewness(salary)    |
+--------------------+
|-0.28089138971711725|
+--------------------+

+-----------------+------------------+-------------------+
|stddev(salary)   |stddev_pop(salary)|stddev_samp(salary)|
+-----------------+------------------+-------------------+
|798.6099033807293|752.9366376043296 |798.6099033807293  |
+-----------------+------------------+-------------------+

+-----------+
|sum(salary)|
+-----------+
|31000      |
+-----------+

/usr/local/lib/python3.11/dist-packages/pyspark/sql/functions.py:988: FutureWarning: Deprecated in 3.2, use sum_distinct instead.
  warnings.warn("Deprecated in 3.2, use sum_distinct instead.", FutureWarning)

+--------------------+
|sum(DISTINCT salary)|
+--------------------+
|20900               |
+--------------------+

+-----------------+-----------------+-----------------+
|var_samp(salary) |var_samp(salary) |var_pop(salary)  |
+-----------------+-----------------+-----------------+
|637777.7777777778|637777.7777777778|566913.5802469136|
+-----------------+-----------------+-----------------+

# prac 4B

In [ ]:
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, sum, avg, max

In [ ]:
spark = SparkSession.builder.appName("exams").getOrCreate()

In [ ]:
simpleData = [("James", "sales", "NY", 90000, 34, 10000),
              ("Michael", "Sales", "NY", 86000, 56, 20000),
              ("Robert", "Sales","CA", 81000, 30, 23000),
              ("Maria", "Finance", "CA", 90000, 24, 23000),
              ("Raman", "Finance", "CA", 99000, 40, 42000),
              ("Scott", "Finance", "NY", 83000, 36, 19000),
              ("Jen", "Finance", "NY", 79000, 53, 15000),
              ("Jeff", "Marketing", "CA", 80000, 25, 18000),
              ("Kumar", "Marketing","NY", 91000, 50, 21000)]

In [ ]:
schema = ["employee_name", "department", "state", "salary", "age", "bonus"]
df=spark.createDataFrame(data=simpleData, schema=schema)
df.printSchema()
df.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |42000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

In [ ]:

df.groupBy("department").sum("salary").show(truncate=False)
df.groupBy("department").count().show()
df.groupBy("department","state").sum('salary','bonus').show()

df.groupBy("department").agg(sum("salary").alias("sum_salary"),avg('salary').alias("avg_salary"),
                             sum("bonus").alias("sum_bonus"),
                             max("age").alias("max_age")).show(truncate=False)

+----------+-----------+
|department|sum(salary)|
+----------+-----------+
|Sales     |167000     |
|Finance   |351000     |
|sales     |90000      |
|Marketing |171000     |
+----------+-----------+

+----------+-----+
|department|count|
+----------+-----+
|     Sales|    2|
|   Finance|    4|
|     sales|    1|
| Marketing|    2|
+----------+-----+

+----------+-----+-----------+----------+
|department|state|sum(salary)|sum(bonus)|
+----------+-----+-----------+----------+
|     sales|   NY|      90000|     10000|
|     Sales|   CA|      81000|     23000|
|   Finance|   CA|     189000|     65000|
|     Sales|   NY|      86000|     20000|
|   Finance|   NY|     162000|     34000|
| Marketing|   NY|      91000|     21000|
| Marketing|   CA|      80000|     18000|
+----------+-----+-----------+----------+

+----------+----------+----------+---------+-------+
|department|sum_salary|avg_salary|sum_bonus|max_age|
+----------+----------+----------+---------+-------+
|Sales     |167000    |83500.0   |43000    |56     |
|Finance   |351000    |87750.0   |99000    |53     |
|sales     |90000     |90000.0   |10000    |34     |
|Marketing |171000    |85500.0   |39000    |50     |
+----------+----------+----------+---------+-------+

In [ ]:
df.groupBy("department")\
  .agg(sum("salary").alias("sum_salary"),\
    avg("salary").alias("avg_salary"),\
    sum("bonus").alias("sum_bonus"),\
    max("bonus").alias("max_bonus"))\
  .where(col("sum_bonus") >= 50000)\
  .show(truncate=False)

+----------+----------+----------+---------+---------+
|department|sum_salary|avg_salary|sum_bonus|max_bonus|
+----------+----------+----------+---------+---------+
|Finance   |351000    |87750.0   |99000    |42000    |
+----------+----------+----------+---------+---------+

# Prac 4C

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Exams").getOrCreate()

In [ ]:
data = [("James", "Sales", 3000),
        ("Michael", "sales", 4600),
        ("Robert", "Sales", 4100),
        ("Maria", "Finance", 3000),
        ("James", "Sales", 3000),
        ("Scott", "Finance", 3300),
        ("Jen", "Finance", 3900),
        ("Kumar", "marketing", 2000),
        ("Saif","sales", 4100)
              ]

In [ ]:
columns = ["Name", "Dept", "salary"]
df = spark.createDataFrame(data=data, schema=columns)
df.distinct().show()
print("Distinct Count:", str(df.distinct().count()))

+-------+---------+------+
|   Name|     Dept|salary|
+-------+---------+------+
|  James|    Sales|  3000|
| Robert|    Sales|  4100|
|Michael|    sales|  4600|
|  Maria|  Finance|  3000|
|  Kumar|marketing|  2000|
|    Jen|  Finance|  3900|
|  Scott|  Finance|  3300|
|   Saif|    sales|  4100|
+-------+---------+------+

Distinct Count: 8

In [ ]:
# Using countDistinct()
from pyspark.sql.functions import countDistinct
df2 = df.select(countDistinct("Dept", "Salary"))
df2.show()
print("Distinct Count of Department&Salary: ", str(df2.collect()[0][0]))

+----------------------------+
|count(DISTINCT Dept, Salary)|
+----------------------------+
|                           8|
+----------------------------+

Distinct Count of Department&Salary:  8

# Prac 4D

In [ ]:
from pyspark.sql import SparkSession, Row
spark = SparkSession.builder.appName("Exams").getOrCreate()

In [ ]:
data = [("James", "Sales", 3000),
        ("Michael", "Sales", 4600),
        ("Robert", "Sales", 4100),
        ("Maria", "Finance", 3000),
        ("Raman", "Finance",3000),
        ("Scott", "Finance", 3300),
        ("Jen", "Finance", 3900),
        ("Jeff", "Marketing", 3000),
        ("Kumar", "Marketing", 2000)]

In [ ]:
df = spark.createDataFrame(data, ["Name", "Department", "salary"])
df.show()

+-------+----------+------+
|   Name|Department|salary|
+-------+----------+------+
|  James|     Sales|  3000|
|Michael|     Sales|  4600|
| Robert|     Sales|  4100|
|  Maria|   Finance|  3000|
|  Raman|   Finance|  3000|
|  Scott|   Finance|  3300|
|    Jen|   Finance|  3900|
|   Jeff| Marketing|  3000|
|  Kumar| Marketing|  2000|
+-------+----------+------+

In [ ]:
# Select first row of group
from pyspark.sql.window import Window
from pyspark.sql.functions import col, row_number
w2 = Window.partitionBy("department").orderBy(col("salary"))
df.withColumn("row", row_number().over(w2))\
  .filter(col("row")==1).drop("row")\
  .show()

+-----+----------+------+
| Name|Department|salary|
+-----+----------+------+
|Maria|   Finance|  3000|
|Kumar| Marketing|  2000|
|James|     Sales|  3000|
+-----+----------+------+

In [ ]:
# Get highest salary of each group
w3 = Window.partitionBy("department").orderBy(col("salary").desc())
df.withColumn("row", row_number().over(w3))\
  .filter(col("row")==1).drop("row")\
  .show()

+-------+----------+------+
|   Name|Department|salary|
+-------+----------+------+
|    Jen|   Finance|  3900|
|   Jeff| Marketing|  3000|
|Michael|     Sales|  4600|
+-------+----------+------+

In [ ]:
# Get max, min, avg, sum of each group
from pyspark.sql.functions import col, row_number, avg, sum, min, max
w4 = Window.partitionBy("department")
df.withColumn("row", row_number().over(w3))\
  .withColumn("avg", avg(col("salary")).over(w4))\
  .withColumn("sum", sum(col("salary")).over(w4))\
  .withColumn("min", min(col("salary")).over(w4))\
  .withColumn("max", max(col("salary")).over(w4))\
  .where(col("row")==1).select("department", "avg", "sum", "min","max")\
  .show()

+----------+------+-----+----+----+
|department|   avg|  sum| min| max|
+----------+------+-----+----+----+
|   Finance|3300.0|13200|3000|3900|
| Marketing|2500.0| 5000|2000|3000|
|     Sales|3900.0|11700|3000|4600|
+----------+------+-----+----+----+